#pandas คือการจัดการและวิเคราะห์ข้อมูลในรูปแบบโครงสร้าง แบบ 1 มิติ และมากกว่า 1 มิติ และต้องใช้งาน ร่วมกับ numpy เพื่อใช้นำไปจัดการข้อมูลมีหลายมิติ (array)

#ส่วนอธิบายเพิ่มเติม *****************************
#เช่น ได้ข้อมูลมา 1 ชุด จะนำมาวิเคราะห์ในฐานข้อมูล ว่า ข้อมูลเป็น อย่างไร 
# แบบ เอาข้อมูลดิบมากรอง ให้เป็น สารสนเทศ หรือนำข้อมูลนำมาประมวลผล ให้ได้ข้อมูลที่เราต้องการ 
#เช่น เรามี ชุดข้อมูล 1 ชุด มี อยู่ แสนบรรทัด เราจะกรองเอาแค่ข้อมูลที่เราต้องการ มาใช้กับงานของเรา 

#ประเภทข้อมูล ที่มีอยู่ในตัว pandas *****************************
#มี 3 ตัว หลักๆ , มองเป็น array จะง่ายกว่า เช่น series คือ array แบบ 1 มิติ หรือมองเป็น list หรือ tuple ก็ได้
#1. Series แบบ 1 มิติ
#2. DataFrame แบบ 2 มิติ
#3. Panel แบบ 3 มิติ

